ideaboard/app/controllers/api/v1/ideas_controller.rb

SELECT "ideas".* FROM "ideas" ORDER BY created_at DESC
---
	  def index
	  	@ideas = Idea.order("created_at DESC")

INSERT INTO "ideas" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", ""], ["body", ""], ["created_at", "2017-10-09 23:57:01.164167"], ["updated_at", "2017-10-09 23:57:01.164167"]]
---
	  def create
	  	@idea = Idea.create(idea_params)

SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT ?  [["id", 25], ["LIMIT", 1]]
UPDATE "ideas" SET "body" = ?, "updated_at" = ? WHERE "ideas"."id" = ?  [["body", "lkhjkh"], ["updated_at", "2017-10-10 02:17:23.843620"], ["id", 25]]
---
	  def update
	  	@idea = Idea.find(params[:id])
	  	@idea.update_attributes(idea_params)

SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "ideas" WHERE "ideas"."id" = ?  [["id", 5]]
---
	  def destroy
	  	@idea = Idea.find(params[:id])
	  	if @idea.destroy